app/Views/layout/layout.php

SELECT *
FROM `fire_cases`
WHERE `is_open` = 0
ORDER BY `case_id` DESC
SELECT COUNT(*) AS `numrows`
FROM `fire_cases`
WHERE `is_open` = 0
---

$db = db_connect();

$result = $db->table('fire_cases')->where('is_open', 0)->orderBy('case_id', 'DESC')->get();

$count = $db->table('fire_cases')
    ->where('is_open', 0)
    ->countAllResults();