app/Views/user/user.php

SELECT *
FROM `request_files`
WHERE `request_id` = '50'
---
                                            <!-- <img src="<?= base_url($request['photo'] ?? '') ?>" alt="No Photo" width="450"> -->
                                            <?php
                                            $dbcon = db_connect();
                                            $files = $dbcon->table('request_files')->where('request_id', $request['id'])->get()->getResultArray();