app/Controllers/FireCaseController.php

SELECT *
FROM `fire_cases`
WHERE `is_notified` = 0
AND `is_deleted` = 0
---
    public function checkFireNotifications()
    {
        $fireModel = new FireCaseModel(); // adjust model name if different

        // Get all new fire cases that are not yet notified
        $fires = $fireModel
            ->where('is_notified', 0)
            ->where('is_deleted', 0) // optional, if you have soft deletes
            ->findAll();